package object.binding.binding1;

//-----------------------------------------------------------------------------------------------------------
// 부모 클래스
//-----------------------------------------------------------------------------------------------------------
class Parent {
	int x = 100;
	void method() {		System.out.println("Parent Method.....");	}
} // End - class Parent
//-----------------------------------------------------------------------------------------------------------
// 자식 클래스
//-----------------------------------------------------------------------------------------------------------
class Child extends Parent {
	int	x = 200;
	void method() {		System.out.println("Child Method.....");	}
} // End - class Child extends Parent
//-----------------------------------------------------------------------------------------------------------
// public class BindingExam
//-----------------------------------------------------------------------------------------------------------
public class BindingExam {
	public static void main(String[] args) {
		Parent	p	= new Child();
		Child	c	= new Child();
		
		// 멤버 변수가 조상 클래스와 자손 클래스에 중복으로 정의된 경우
		// 조상타입의 참조변수를 사용했을 때는 조상 클래스에 선언된 멤버변수가 사용되고,
		// 자손타입의 참조변수를 사용했을 때는 자손 클래스에 선언된 멤버변수가 사용된다.
		
		// 메서드의 경우는 참조변수에 관계없이 실제 인스턴스의 타입인
		// Child 클래스에 정의된 메서드가 호출된다.
		
		System.out.println("p.x => " + p.x);
		p.method();
		
		System.out.println("c.x => " + c.x);
		c.method();
	}
} // End - public class BindingExam











